results-petclinic-native/run_5_2026-01-05_01-27-03/FIXED-3000-latency-1-dump.txt
Running 30s test @ http://127.0.0.1:8006
  16 threads and 16 connections
  Thread calibration: mean lat.: 1.961ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.935ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.969ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.969ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.948ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.939ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.880ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.883ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.907ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.858ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.875ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.901ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.918ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.888ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.894ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.912ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.94ms    1.76ms  26.69ms   96.88%
    Req/Sec   195.72     51.65   666.00     79.96%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.68ms
 75.000%    1.99ms
 90.000%    2.31ms
 99.000%   12.59ms
 99.900%   20.58ms
 99.990%   23.49ms
 99.999%   26.14ms
100.000%   26.70ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.697     0.000000            1         1.00
       1.173     0.100000         6015         1.11
       1.330     0.200000        12015         1.25
       1.455     0.300000        17997         1.43
       1.570     0.400000        24050         1.67
       1.679     0.500000        29993         2.00
       1.736     0.550000        33008         2.22
       1.792     0.600000        35999         2.50
       1.851     0.650000        39006         2.86
       1.914     0.700000        42017         3.33
       1.987     0.750000        45014         4.00
       2.026     0.775000        46507         4.44
       2.067     0.800000        48043         5.00
       2.113     0.825000        49526         5.71
       2.163     0.850000        51000         6.67
       2.227     0.875000        52498         8.00
       2.263     0.887500        53234         8.89
       2.309     0.900000        54002        10.00
       2.361     0.912500        54730        11.43
       2.435     0.925000        55482        13.33
       2.591     0.937500        56235        16.00
       2.765     0.943750        56606        17.78
       2.949     0.950000        56980        20.00
       3.189     0.956250        57358        22.86
       3.431     0.962500        57731        26.67
       3.705     0.968750        58105        32.00
       3.881     0.971875        58294        35.56
       4.061     0.975000        58479        40.00
       4.315     0.978125        58666        45.71
       4.987     0.981250        58854        53.33
       7.383     0.984375        59042        64.00
       8.855     0.985938        59135        71.11
      10.367     0.987500        59229        80.00
      11.863     0.989062        59322        91.43
      13.159     0.990625        59416       106.67
      14.655     0.992188        59510       128.00
      15.183     0.992969        59557       142.22
      15.815     0.993750        59604       160.00
      16.623     0.994531        59651       182.86
      17.199     0.995313        59697       213.33
      17.871     0.996094        59744       256.00
      18.255     0.996484        59768       284.44
      18.559     0.996875        59792       320.00
      18.767     0.997266        59814       365.71
      19.103     0.997656        59838       426.67
      19.375     0.998047        59861       512.00
      19.647     0.998242        59875       568.89
      19.855     0.998437        59885       640.00
      20.175     0.998633        59897       731.43
      20.335     0.998828        59908       853.33
      20.607     0.999023        59920      1024.00
      20.735     0.999121        59926      1137.78
      20.959     0.999219        59932      1280.00
      21.055     0.999316        59937      1462.86
      21.247     0.999414        59943      1706.67
      21.455     0.999512        59949      2048.00
      21.663     0.999561        59953      2275.56
      21.775     0.999609        59955      2560.00
      21.887     0.999658        59958      2925.71
      22.143     0.999707        59961      3413.33
      22.447     0.999756        59964      4096.00
      22.479     0.999780        59965      4551.11
      22.575     0.999805        59968      5120.00
      22.575     0.999829        59968      5851.43
      23.167     0.999854        59970      6826.67
      23.295     0.999878        59971      8192.00
      23.487     0.999890        59972      9102.22
      23.679     0.999902        59973     10240.00
      23.679     0.999915        59973     11702.86
      23.775     0.999927        59974     13653.33
      24.095     0.999939        59975     16384.00
      24.095     0.999945        59975     18204.44
      25.583     0.999951        59976     20480.00
      25.583     0.999957        59976     23405.71
      25.583     0.999963        59976     27306.67
      26.143     0.999969        59977     32768.00
      26.143     0.999973        59977     36408.89
      26.143     0.999976        59977     40960.00
      26.143     0.999979        59977     46811.43
      26.143     0.999982        59977     54613.33
      26.703     0.999985        59978     65536.00
      26.703     1.000000        59978          inf
#[Mean    =        1.941, StdDeviation   =        1.762]
#[Max     =       26.688, Total count    =        59978]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  90010 requests in 30.00s, 133.89MB read
Requests/sec:   3000.37
Transfer/sec:      4.46MB